In [1]:
import pandas as pd

In [2]:
d = {"A":[11,22,33],"B":[12,13,14],"C":["aa","bb","cc"]}
df = pd.DataFrame(d)
df

    A   B   C
0  11  12  aa
1  22  13  bb
2  33  14  cc

In [3]:
# Q1. List any five functions of the pandas library with execution.
df.describe() #describe integer columns

          A     B
count   3.0   3.0
mean   22.0  13.0
std    11.0   1.0
min    11.0  12.0
25%    16.5  12.5
50%    22.0  13.0
75%    27.5  13.5
max    33.0  14.0

In [4]:
df.columns  #returns list of columns

Index(['A', 'B', 'C'], dtype='object')

In [8]:
df.dtypes  #returns datatypes of columns

A     int64
B     int64
C    object
dtype: object

In [9]:
df.head(1) #return top 1 row. By default returns 5 rows

    A   B   C
0  11  12  aa

In [10]:
df.loc[1,"B"] #select element by index name

13

SyntaxError: invalid syntax (1830641140.py, line 1)

In [34]:
# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to 
# re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.
df.index = range(1,6,2)
df

    A   B   C
1  11  12  aa
3  22  13  bb
5  33  14  cc

In [39]:
# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
# iterates over the DataFrame and calculates the sum of the first three values in the 'Values' 
# column. The function should print the sum to the console.
# For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function
# should calculate and print the sum of the first three values, which is 60.

df = pd.DataFrame({"Values":[10,20,30,40,50]})
sum = 0
for i in df.Values[0:3]:
    sum = sum + i
    
print(sum)

60

In [50]:
# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new 
# column 'Word_Count' that contains the number of words in each row of the 'Text' column.
df = pd.DataFrame({"Text":["Pune is a city","Surat in Gujarat","Bangalore has IT companies"]})
df

                         Text
0              Pune is a city
1            Surat in Gujarat
2  Bangalore has IT companies

In [51]:
df['Word_Count'] = df['Text'].str.split().str.len()
df

                         Text  Word_Count
0              Pune is a city           4
1            Surat in Gujarat           3
2  Bangalore has IT companies           4

In [53]:
# Q5. How are DataFrame.size() and DataFrame.shape() different?
df.shape #returns rows and columns

(3, 2)

In [54]:
df.size  #returns total number of entries

6

In [ ]:
# Q6. Which function of pandas do we use to read an excel file?
pd.read_excel() is used to read excel file.
the path of excel file is passed as an argument

In [55]:
# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
# addresses in the format 'username@domain.com'. Write a Python function that creates a new column
# 'Username' in df that contains only the username part of each email address.
# The username is the part of the email address that appears before the '@' symbol. For example, if the
# email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
# function should extract the username from each email address and store it in the new 'Username'
# column.
df = pd.DataFrame({"Email":['anita@gmail.com','geeta@example.com','pratik@gmail.com']})

In [72]:
df['Username'] = df['Email'].str.split("@").str[0]

df

               Email Username
0    anita@gmail.com    anita
1  geeta@example.com    geeta
2   pratik@gmail.com   pratik

In [2]:
# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
# all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
# function should return a new DataFrame that contains only the selected rows.
# The function should return a new DataFrame that contains only the selected rows.

df = pd.DataFrame({"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [7]:
df[(df["A"] > 5) & (df["B"] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [8]:
# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the 
# mean, median, and standard deviation of the values in the 'Values' column.
df = pd.DataFrame({"Values":[2,8,7,1,6]})
df

   Values
0       2
1       8
2       7
3       1
4       6

In [13]:
print("Mean: ",df.mean(),"\nMedian: ",df.median(),"\nStandard Deviation: ",df.std())

Mean:  Values    4.8
dtype: float64
Median:  Values    6.0
dtype: float64
Standard Deviation:  Values    3.114482
dtype: float64

In [21]:
# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
# create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
# for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
# should include the current day.
df = pd.DataFrame({"Sales":[1000,1500,3000,2000,4500,8000,6500,2500],
                 "Date":['2023-12-1','2023-12-2','2023-12-3','2023-12-4','2023-12-5','2023-12-6',
                        '2023-12-7','2023-12-8']})
df

   Sales       Date
0   1000  2023-12-1
1   1500  2023-12-2
2   3000  2023-12-3
3   2000  2023-12-4
4   4500  2023-12-5
5   8000  2023-12-6
6   6500  2023-12-7
7   2500  2023-12-8

In [22]:
df["MovingAverage"] = df['Sales'].rolling(window=7).mean()

In [23]:
df
# Values are NaN because window size is 7. So 7 values are taken to calculate MovingAverage on
# index 6.

   Sales       Date  MovingAverage
0   1000  2023-12-1            NaN
1   1500  2023-12-2            NaN
2   3000  2023-12-3            NaN
3   2000  2023-12-4            NaN
4   4500  2023-12-5            NaN
5   8000  2023-12-6            NaN
6   6500  2023-12-7    3785.714286
7   2500  2023-12-8    4000.000000

In [26]:
# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
# column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
# Monday, Tuesday) corresponding to each date in the 'Date' column.
df = pd.DataFrame()
df["date"] = pd.date_range(start = '2023-01-01',periods=7)
df

        date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
5 2023-01-06
6 2023-01-07

In [28]:
import datetime
df["Weekday"] = df["date"].apply(lambda x: datetime.datetime.strftime(x, '%A')) 
# apply() iterates over length of df. x variable inputs date and %A returns day of week
df

        date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday
5 2023-01-06     Friday
6 2023-01-07   Saturday

In [10]:
# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
# function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [17]:
diction = {"DateTime": [pd.Timestamp('2023-01-01T12'),pd.Timestamp('2023-01-16T12'),
                    pd.Timestamp('2023-02-03T12'),pd.Timestamp('2023-02-04T12')]}
df = pd.DataFrame(diction)
df
# created a dataframe with timestamps

             DateTime
0 2023-01-01 12:00:00
1 2023-01-16 12:00:00
2 2023-02-03 12:00:00
3 2023-02-04 12:00:00

In [27]:
df['Date'] = pd.to_datetime(df['DateTime']).dt.date
df
# created new column with only dates

             DateTime        Date
0 2023-01-01 12:00:00  2023-01-01
1 2023-01-16 12:00:00  2023-01-16
2 2023-02-03 12:00:00  2023-02-03
3 2023-02-04 12:00:00  2023-02-04

In [28]:
df['Date'] = df["Date"].apply(lambda x : str(x))
# date column converted to string to apply logic

In [29]:
df['Date'][0]
# cross check string value of date

'2023-01-01'

In [33]:
def select_date(x):
    if x in pd.date_range(start = '2023-01-01', end='2023-01-31'):
        print(x)
        
select_date('2023-01-04') #calling function
# function written to check dates between given '2023-01-01' and '2023-01-31'

2023-01-04

In [36]:
    
df1 = df["Date"].apply(select_date)
# selecting the required answer

2023-01-01
2023-01-16

In [ ]:
# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that 
# needs to be imported?
To use pandas , we have to import pandas library, example:
import pandas as pd